
-- INSERT Test Data category-base 
insert into categories values
(1, "ทั่วไป"),(2, "ทุนการศึกษา"),(3, "หางาน"),(4, "ฝึกงาน");

-- INSERT Test Data announcement-base 
insert into announcements values
(1, "บริษัท เน็ตเซอร์พลัส จํากัด รับสมัครงาน 2 ตําแหน่ง", "บริษัท เน็ตเซอร์พลัส จํากัด เป@ดรับสมังาน 2 ตําแหน่ง Application Support และ Customer Support", null, null, "N", 3),
(2, "รายชื่อนักศึกษาที่ได้รับทุนการศึกษาประเภท ทุนจ้างงาน 2/2565", "คณะ ฯประกาศรายชื่อนักศึกษาที่ได[รับทุนการศึกษาประเภท ทุนจ้างงาน ประจําภาคการศึกษา 2/2565", null, "2023-05-31 18:00:00", "Y", 2),
(3, "แนวปฎิบัติการสอบออนไลน์ พ.ศ. 2565", "ประกาศมหาวิทยาลัยเทคโนโลยีพระจอมเกล[าธนบุรี เรื่องแนวทางปฎิบัติการสอบออนไลน์ พ.ศ. 2565","2023-01-27 06:00:00", null, "Y", 1),
(4, "กิจกรรมพี่อ้อย พี่ฉอด On Tour 2566", "ขอเชิญนักศึกษาทุกชั้นป๊ เข้าร่วมกิจกรรมพี่อ้อย พี่ฉอด On Tour","2023-04-19 06:00:00", "2023-05-08 18:00:00", "Y", 1);